
#长字符串(取值跨越多行变量,例如长数组,或者每个元素带有注释的数组),配置在这个文件里,要求头部手动将一般的变量赋值 $ 改为 $global:
# 另一个方案是赋值给`$env:var`
$global:cjkPunctuationArray = (
    ',',         # 全角逗号
    '.',         # 全角句号
    '“”',       # 全角双引号对
    '‘’',        # 全角单引号对
    '《》',      # 全角书名号对
    '（）',      # 全角圆括号对
    '',':',        # 全角分号和冒号
    '?','!',        # 全角问号和感叹号
    '…',         # 全角省略号
    '-',         # 全角短横线（一般用于连接）
    '—',         # 全角长破折号
    '、'         # 全角顿号
)

$global:PrintableChars = (
    'a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l', 'm',
    'n', 'o', 'p', 'q', 'r', 's', 't', 'u', 'v', 'w', 'x', 'y', 'z',
    'A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M',
    'N', 'O', 'P', 'Q', 'R', 'S', 'T', 'U', 'V', 'W', 'X', 'Y', 'Z',
    '0', '1', '2', '3', '4', '5', '6', '7', '8', '9',
    '!', '@', '#', '$', '%', '^', '&', '*', '(', ')', '-', '_', '+', '=', '{', '}', '[', ']', '|', '\', ':', ';', "'", '"', '<', '>', ',', '.', '?', '/', ' '
)
